# SQL in python

In [1]:
import pandas as pd
import sqlalchemy as db
import getpass

In [2]:
password=getpass.getpass('Introduce tu password de SQL : ')

Introduce tu password de SQL : ········

In [3]:
engine=db.create_engine('mysql+pymysql://root:{}@localhost/publications'.format(password))
print ('Conectado.')

Conectado.

In [4]:
query='''select group_concat(t.title) as titles,
         t.year
         from (select title, year(max(pubdate)) as 'year',
         count(titleauthor.title_id) as numauthors,
         group_concat(concat(authors.au_fname, ' ', authors.au_lname)) as authors
         from titles
         left join titleauthor
         on titles.title_id=titleauthor.title_id
         left join authors
         on authors.au_id=titleauthor.au_id
         group by titles.title
         order by numauthors desc) as t
         group by t.year;
'''

In [5]:
df=pd.read_sql_query(query, engine)
df

                                              titles  year
0  Is Anger the Enemy?,Straight Talk About Comput...  1991
1                          Secrets of Silicon Valley  1994
2   Net Etiquette,The Psychology of Computer Cooking  2014

In [6]:
a=df.titles[0]
a.split(',')

['Is Anger the Enemy?',
 'Straight Talk About Computers',
 "The Busy Executive's Database Guide",
 'Life Without Fear',
 'The Gourmet Microwave',
 'Prolonged Data Deprivation: Four Case Studies',
 'But Is It User Friendly?',
 'Sushi',
 ' Anyone?',
 'You Can Combat Computer Stress!',
 'Onions',
 ' Leeks',
 ' and Garlic: Cooking Secrets of the Mediterranean',
 'Computer Phobic AND Non-Phobic Individuals: Behavior Variations',
 'Emotional Security: A New Algorithm',
 'Cooking with Computers: Surreptitious Balance Sheets',
 'Silicon Valley Gastronomic Treats',
 'Fifty Years in Buckingham Palace Kitchens']

In [7]:
%time pd.read_sql_query('select * from publications.employee;', engine)['job_id'].sum()

CPU times: user 4.77 ms, sys: 1.39 ms, total: 6.16 ms
Wall time: 5.82 ms

365

In [8]:
%time pd.read_sql_query('select sum(job_id) as j from publications.employee;', engine)['j'][0]

CPU times: user 1.77 ms, sys: 860 µs, total: 2.63 ms
Wall time: 4.14 ms

365.0

In [10]:
pd.read_sql_query('show tables', engine)

   Tables_in_publications
0                 authors
1               discounts
2                employee
3                    jobs
4                pub_info
5              publishers
6                roysched
7                   sales
8                  stores
9             titleauthor
10                 titles

In [13]:
pd.read_sql_query('select * from publications.sales', engine)

   stor_id   ord_num   ord_date  qty    payterms title_id
0     6380      6871 1994-09-14    5      Net 60   BU1032
1     6380      722a 1994-09-13    3      Net 60   PS2091
2     7066     A2976 1993-05-24   50      Net 30   PC8888
3     7066  QA7442.3 1994-09-13   75  ON invoice   PS2091
4     7067     D4482 1994-09-14   10      Net 60   PS2091
5     7067     P2121 1992-06-15   40      Net 30   TC3218
6     7067     P2121 1992-06-15   20      Net 30   TC4203
7     7067     P2121 1992-06-15   20      Net 30   TC7777
8     7131   N914008 1994-09-14   20      Net 30   PS2091
9     7131   N914014 1994-09-14   25      Net 30   MC3021
10    7131    P3087a 1993-05-29   20      Net 60   PS1372
11    7131    P3087a 1993-05-29   25      Net 60   PS2106
12    7131    P3087a 1993-05-29   15      Net 60   PS3333
13    7131    P3087a 1993-05-29   25      Net 60   PS7777
14    7896    QQ2299 1993-10-28   15      Net 60   BU7832
15    7896     TQ456 1993-12-12   10      Net 60   MC2222
16    7896      X999 1993-02-21   35  ON invoice   BU2075
17    8042  423LL922 1994-09-14   15  ON invoice   MC3021
18    8042  423LL930 1994-09-14   10  ON invoice   BU1032
19    8042      P723 1993-03-11   25      Net 30   BU1111
20    8042   QA879.1 1993-05-22   30      Net 30   PC1035